import java.util.Date;

public interface Blacksmith {
	
	public final static String[] name = {"Внутренний документ", "Архивное дело", "Входящий документ", "Поступивший документ", "Исходящий документ",
			"Заявление", "Протокол", "Учредительный договор", "Устав предприятия", "Свидетельство"};
	
	public final static String[] author = {"Антон Силуанов", "Константин Чуйченко", "Максим Акимов", "Юрий Борисов", "Татьяна Голикова", 
			"Ольга Голодец", "Алексей Гордеев", "Дмитрий Козак", "Виталий Мутко", "Юрий Трутнев"};
	
	public static String[] addresser = {"Тимур Гришин", "Артём Рожков", "Виктор Рогов", "Данила Степанов", "Ярослав Носков", 
			"Анатолий Жданов", "Егор Родионов", "Алексей Фокин", "Ростислав Кудрявцев", "Игорь Кириллов"};
	
	public static String[] addressee = {"Юрий Киселёв", "Данила Сафонов", "Тимур Кузнецов", "Григорий Носов", "Эдуард Харитонов",
			"Никита Гуляев", "Пётр Большаков", "Олег Капустин", "Анатолий Силин", "Валерий Богданов"};

	public Document manufactureDocument() throws DocumentExistsException;
	
	public Date setDate();
	
}
